In [1]:
import numpy as np
import pandas as pd

In [10]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
df2 = pd.DataFrame({'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [11]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [12]:
df2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [13]:
#axis0 : along rows

pd.concat([df1,df2],axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [14]:
#axis1 : along columns
pd.concat([df1,df2],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

# Merge

In [23]:
reg = pd.DataFrame({'reg_id':[1,2,3,4],'name':['A','B','C','D']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['X','A','Y','B']})
reg

   reg_id name
0       1    A
1       2    B
2       3    C
3       4    D

In [24]:
logins

   log_id name
0       1    X
1       2    A
2       3    Y
3       4    B

In [25]:
#help(pd.merge)

In [27]:
#inner
pd.merge(reg,logins,how='inner',on='name')

   reg_id name  log_id
0       1    A       2
1       2    B       4

In [28]:
#left
pd.merge(reg,logins,how='left',on='name')

   reg_id name  log_id
0       1    A     2.0
1       2    B     4.0
2       3    C     NaN
3       4    D     NaN

In [29]:
#right
pd.merge(reg,logins,how='right',on='name')

   reg_id name  log_id
0     NaN    X       1
1     1.0    A       2
2     NaN    Y       3
3     2.0    B       4

In [30]:
#outer
#left
pd.merge(reg,logins,how='outer',on='name')

   reg_id name  log_id
0     1.0    A     2.0
1     2.0    B     4.0
2     3.0    C     NaN
3     4.0    D     NaN
4     NaN    X     1.0
5     NaN    Y     3.0

In [36]:
reg = pd.DataFrame({'id':[1,2,3,4],'reg_name':['A','B','C','D']})
logins = pd.DataFrame({'id':[1,2,3,4],'logins_name':['X','A','Y','B']})

In [37]:
reg

   id reg_name
0   1        A
1   2        B
2   3        C
3   4        D

In [38]:
logins

   id logins_name
0   1           X
1   2           A
2   3           Y
3   4           B

In [43]:
df5 = pd.merge(reg,logins,how='inner',left_on='reg_name',right_on='logins_name',suffixes=('_reg','_logins')).drop('reg_name',axis=1)

In [44]:
df5

   id_reg  id_logins logins_name
0       1          2           A
1       2          4           B

In [46]:
df5['name'] = df5['logins_name']

In [49]:
df5.drop('logins_name',axis=1)

   id_reg  id_logins name
0       1          2    A
1       2          4    B